# 1. 导入分解库（唯一正确写法）
from factordb.factordb import FactorDB
import gmpy2
import libnum

# 2. 你的目标大数n（直接粘贴题目里的n）
n = 2627832721798532654645633759787364870195582649392807630554510880534973280751482201937816738488273589173932960856611147584617677312265144131447658399933331448791094639659769069406481681017795446858858181106274806005669388289349727511470680972

# 3. 3行代码完成质因数分解（核心操作）
fdb = FactorDB(n)       # 绑定要分解的数字
fdb.connect()           # 执行分解请求
factors = fdb.get_factor_list()  # 获取最终质因数列表

# 4. 打印分解结果
print("="*80)
print(f"✅ 大数{n} 的质因数分解结果为：")
print(factors)
print("="*80)


c = 96830301447792999743877932210925094490214669785432172099311147672020980136112114653571739648595225131425493319224428213036136642899189859618195566355934768513439007527385261977662612094503054618556883356183687422846428828606638722387070581
 
e = 65537
 
# p_list: 这个列表包含了 n 的质因子（p），这些质因子是对 n 的分解。对于RSA算法，n 通常是两个大质数 p 和 q 的乘积，但这里 n 被分解成了多个质数的乘积
p_list =factors
# 思路：
#    如果 n 是多个不同质数的乘积（即 n = p1 * p2 * ... * pk），则有 φ(n) = (p1 - 1) * (p2 - 1) * ... * (pk -
#    代码通过循环 for p in p_list，逐个处理 p_list 中的质因子 p
#    对每一个质因子 p，计算 p-1，并乘到 phi_n 上。最终 phi_n 将是所有 (p-1) 的乘积
phi_n = 1
 
for p in p_list:
    phi_n *= (p - 1)
 
# 计算出 phi_n 后，代码使用 gmpy2.invert(e, phi_n) 计算私钥 d，这一步是根据RSA的逆元性质，即 d 是 e 在模 φ(n) 意义下的逆元
d = gmpy2.invert(e, phi_n)
 
# 使用私钥 d 进行解密 m = pow(c, d, n)，并将结果转为字节格式得到 flag
m = pow(c, d, n)
 
flag = libnum.n2s(int(m))
flag=flag.decode("utf-8") 
print(flag)
