from sympy import nextprime
import libnum
import gmpy2

n = 1058756604181685917958185571746711428601045466594619627088399455470892502310139608978164573773765910533535849969889860275644658086339362201840191861497991951344100284004205747279828567835277683
c = 643011921358774538378881505518732362708757638007688649119354348647468190640688857686213431516881297805187671774564672497176686191162897918672339254715366498963369868410476737543157157149810569
e = 65537

# p1 ≈ r^5
# q1 ≈ r^5
# n ≈ (r^5) * (r^5) = r^10
# iroot(n, 10)[0] 是计算 n 的第10次方根
r_prox = gmpy2.iroot(n, 10)[0]
print(r_prox)

# 循环遍历
for r in range(r_prox - 2000, r_prox + 2000):
    p1 = r**5 + r**4 - r**3 + r**2 - r + 2024
    q1 = r**5 - r**4 + r**3 - r**2 + r + 2024
    p = nextprime(p1)
    q = nextprime(q1)

    if p * q == n:
        print(r)
        # 计算私钥 欧拉函数φ(n) = (p-1)(q-1) = {phi_n}
        phi_n = (p - 1) * (q - 1)

        # d 是 e 在模 φ(n) 下的逆元
        d = gmpy2.invert(e, phi_n)

        # 求密文
        m = pow(c, d, n)

        # 求明文
        Z = libnum.n2s(int(m))

        decrypted_flag = Z.decode("utf-8")

        print(decrypted_flag)
        break
