from Crypto.PublicKey import RSA
from Crypto.Cipher import PKCS1_OAEP
import gmpy2
import base64

with open("pubkey.pem", "r") as f:  # 首先读取文件内容，并把内容赋值给data
    data = f.read()

print(data)

pub = RSA.importKey(data)  # 解析data数据
n, e = pub.n, pub.e  # 这里把解析得到的n和e分别赋值给n和e

print(n)

# 然后对n进行分解，可以用在线工具，也可以用离线工具yafu中的factor函数。这道题目的n我试了一下，离线工具分解不出来，就用在线工具
p = 157790417717035275943197904823645145281147085252905247447260034051878691034747684303715336348507267921249655103263347914128144476912685213431110454636244692224328066884510063590700506729345331153483633231327359450199822698241355428609085077662488946173655043172957247264543259611018596088670385591091710018977
q = 167343506005974003380506069679607737381940204686173214188860057004909006055220516074283090160430833007424970980655748310232878462615469792561310560310363430669700009093597847018287568821792168143170329382585883857083334915378884054389878477389765792275111293420203613159303898365894897865177093362621517279751
phi_n = (p - 1) * (q - 1)

d = int(gmpy2.invert(e, phi_n))

with open(
    "flag.enc", "r"
) as f:  # 读取文件内容，把他赋值给temp_flag，并且进行base64解码
    temp_flag = f.read()
temp_flag = base64.b64decode(temp_flag)

private_key = RSA.construct(
    (n, e, d, p, q)
)  # 这里是创建一个私钥对象。还要注意这里传入的是元组，并且里面的元素顺序有要求。
print(private_key)

de = PKCS1_OAEP.new(private_key)  # 这里是生成一个解密器，用于后面的解密


flag = de.decrypt(
    temp_flag
)  # 用解密器对其进行解码，这里传入的是要解码的内容，类型为字节串。和传统的大数字，最后通过long_to_bytes来转化为字节串，有所区别。
print(flag.decode("utf-8"))
